src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ, Замещение)
	
	КоличествоЗаписей = Количество();
	
	Для Сч = 1 По КоличествоЗаписей Цикл
		
		Индекс = КоличествоЗаписей - Сч;
		Если Не ЗначениеЗаполнено(ЭтотОбъект[Индекс].Ссылка) Тогда
			Удалить(Индекс);
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект[Индекс].Основной Тогда
			
			ПризнакОсновной(ЭтотОбъект[Индекс]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку")
		И ДополнительныеСвойства.НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку Тогда
		Возврат;
	Иначе
		ДополнительныеСвойства.Вставить("ДанныеДляОпределенияИзменений", ДанныеДляОпределенияИзменений());
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку")
		И ДополнительныеСвойства.НеОпределятьИзменениеОбъектыБлокирующиеЗагрузку Тогда
		Возврат;
	Иначе
		ПроверитьБлокирующиеОбъектыЕслиНеобходимо(ДополнительныеСвойства);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляОпределенияИзменений()
	
	Возврат РаботаСРезультатамиОбмена.ТаблицаЗаписейПоОтборуНабораЗаписей(Отбор, "ПубличныеИдентификаторыСинхронизируемыхОбъектов", "Идентификатор, УзелИнформационнойБазы");
	
КонецФункции

Процедура ПроверитьБлокирующиеОбъектыЕслиНеобходимо(ДанныеДляПроверки)
	
	ТаблицаСтарыхЗаписей = ДанныеДляПроверки.ДанныеДляОпределенияИзменений;
	
	КлючОбрабатывающегоЗадания = Неопределено;
	Если ДанныеДляПроверки.Свойство("КлючОбрабатывающегоЗадания") 
		И Не ПустаяСтрока(ДанныеДляПроверки.КлючОбрабатывающегоЗадания) Тогда
		
		КлючОбрабатывающегоЗадания = ДанныеДляПроверки.КлючОбрабатывающегоЗадания;
		
	КонецЕсли;
	
	Если ТаблицаСтарыхЗаписей = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = РаботаСРезультатамиОбмена.УсловиеЗапросаПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаСтарыхЗаписей.Идентификатор          КАК Идентификатор,
	|	ТаблицаСтарыхЗаписей.УзелИнформационнойБазы КАК УзелИнформационнойБазы
	|ПОМЕСТИТЬ СтарыйНабор
	|ИЗ
	|	&ТаблицаСтарыхЗаписей КАК ТаблицаСтарыхЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Идентификатор          КАК Идентификатор,
	|	ТаблицаРегистра.Идентификатор          КАК ОбъектФормата,
	|	ТаблицаРегистра.УзелИнформационнойБазы КАК УзелИнформационнойБазы
	|ПОМЕСТИТЬ НовыйНабор
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ТаблицаРегистра
	|ГДЕ
	|	&УсловиеЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыйНабор.Идентификатор          КАК Идентификатор,
	|	НовыйНабор.ОбъектФормата          КАК ОбъектФормата,
	|	НовыйНабор.УзелИнформационнойБазы КАК УзелИнформационнойБазы
	|ИЗ
	|	НовыйНабор КАК НовыйНабор
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтарыйНабор КАК СтарыйНабор
	|		ПО НовыйНабор.Идентификатор = СтарыйНабор.Идентификатор
	|			И НовыйНабор.УзелИнформационнойБазы = СтарыйНабор.УзелИнформационнойБазы
	|ГДЕ
	|	СтарыйНабор.Идентификатор ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаСтарыхЗаписей", ТаблицаСтарыхЗаписей);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗапроса", ТекстУсловия);
	
	ТаблицаЗаписейКПроверке = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписейКПроверке.Количество() > 0 Тогда
		РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ОбработатьНовыеУстановленныеСоответствия(ТаблицаЗаписейКПроверке, КлючОбрабатывающегоЗадания);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПризнакОсновной(ПроверяемаяЗапись)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", ПроверяемаяЗапись.Идентификатор);
	Запрос.УстановитьПараметр("Ссылка", ПроверяемаяЗапись.Ссылка);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", ПроверяемаяЗапись.УзелИнформационнойБазы);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПИСО.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
	|ГДЕ
	|	ПИСО.Идентификатор <> &Идентификатор
	|	И ПИСО.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ПИСО.Ссылка = &Ссылка
	|	И ПИСО.Основной = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ПроверяемаяЗапись.Основной = ЛОЖЬ;
		
		ТекстСобытие = ОбменДаннымиСервер.СобытиеЖурналаРегистрацииОбменДанными();
		ТекстРасшифровка = НСтр("ru ='Запись публичного идентификатора'", ОбщегоНазначения.КодОсновногоЯзыка());
		СобытиеЖурналаРегистрации = СокрЛП(ТекстСобытие) + "." + СокрЛП(ТекстРасшифровка);
		
		ОбъектМетаданных = Метаданные.РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов;
		ШаблонПредупреждения = НСтр("ru ='Неудачная попытка установить основной идентификатор [%1]
		|для ссылки [%2]
		|по настройке обмена [%3],
		|т.к. основной идентификатора уже назначен [%4].'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, ПроверяемаяЗапись.Идентификатор, 
			ПроверяемаяЗапись.Ссылка, ПроверяемаяЗапись.УзелИнформационнойБазы, Выборка.Идентификатор);
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение, ОбъектМетаданных, , ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
